let modInfo = {
	name: "j̶͔̝̫̹̥̲̰̦̞͕̤̪̋̔͐̊̾̂̐̓̏̀̾̃̄͒́̓̈̃̇̊̏͌̔͐̚͜͠h̴̺͍͂̓̏̈́̓̓x̵̨̭̻̲̰̜́̎̐̀̓̈́̕͜͝h̶̯͙͔̫͍̜̳̝͙̲̓̿͛́͂̽̽̓̌̎̾̓̎̈́́̆̄̏̇͐̾͛͌͒͜͝q̵̧̹̰̤̟̾̐̿͗̆̈̈̋̆̓̾̒̀̀͜͜͝s̴̱̘͓͔̟̬̻͗̊ͅụ̸̢̡̨̨̤͉͈͈̠̪̖̝͈̮̯̟̦̝̻̪̻͕̞̗̙̞͎̪͉͕͕͈̙̟͂̌̾̋̒̆͐͑́͐́͐̓͂̃͒̄̏́̀̑͗̈́͜͝ͅͅͅͅh̶̛̛̹̯̙̟͍̍̂̋̇̆͗͗̋̂̾͌̒̕͘͠͝͠͠͠w̶̧̛̝̼͖͉̻̘̬̖̭̜̾͂̈́̊̄͒͐̑̆̏́̊̃͗̈̽̇͆̒̏̀̐͘͝͝ù̵̧̨͈͉̼͇͖͎͕̙̟̮̮̜̲̭͖̔͒̏̀̑̔̈́͛̈͌͋̆̔̃̏͆̓͊̕̕͜s̸̡̧̨̢̮̼͖̻͓̫̜̝͖͔̦̹̠̍̉̀̃̋̄̈́͘͜w̵̧̢̧̧̩͈̼̠̭͇̝͎͔͍̭̬̺̭̞̖̫̖͕̩̙͍̪͖͖͎͍̃̔͛̓ͅͅg̴̡̦̙̫̝̖̹̭̬̤̻̫͉̦͈̝͙̩͇̜͚̠̫̰̟͋̄ͅų̵̡̯͉͍̯͓͙̞͔̮͇̰̜̜̣̥̭͎̤̬̰͈͍͙̙̬͖͕̫̹̲̲̮̥̙̟̭̺̺̔͠s̵̡̛̤̪̱̼̘̥͈̟̫̩̊̀͆̏̈́̓͒̎̍͌̄̃̈̒͛́̿̋̍̈̈́̚̕͘̚͝͝ͅư̶̢̢͉͈̱͚͖͔̗̪͇̱̖̩̻͙̲͎͔̻͕̩̟̳̯̥͙͉͍̦͕̠̪̻̅͆̋̄̀͌̔͗̒̄͘͘ͅi̵̛̫͚̯͇͔͋̇̑̌̈̆̂̀͐͐́̋͌̎̊͐͒͋̽̊̉͝͠w̴̧̢͓̮͇͙̙̞͙̱̭̘͊̆̀̉̎͆̆̓͋̎͌̄̌̿̑̅̍̒ȉ̴̢̧̛͚̭̹̤̞̰̻̙̜̥̥̖͈͍̻̥̲̥̭͆̔̊͌̔́̾͛̐̋̆̐̏̍̂̃̐̍̌̕͘͘ͅͅs̷̢̨̗͕̰͔͍̜̜̺͇͙̝̼͇͔͔̤͕̺̙̰̦̃̄͒̌̓̀͆̂͒̓̀͑́̇̚͘͘ũ̸̢̖̙̩̟̅͒̍͛͌́̈́̽̑͂͛͒̅͗̊̾w̵̢̡̧̨̧̬͙͍̰̝̖͙͇̘͔͓͕̪̠̙̦̙̯̯̲͇̠͇͓̖̹̣̙̩͚̉̅̋̃̑̂̂͊̿͗̃̀̃́̈̿̓̀̆̒̈̈́̿͑̿̇́̕̕͘̕͜͠͠͝ͅͅư̶̡̡̨͉̫̠̞̳̩͉̲̤͙͍̗̪̟̲̜̳͍̻̼̖̅̓̐̏͐̓̈́͋̑̌́͗̿̓́̓̈́̏͑̇̀̊̌͒̀̽̄͛͂̔͊̊̇̽̚͘͜͜͝͝͝ͅͅͅ",
	id: "yunigopoh",
	author: "k̴̖̼͚̘͍̈́͊͌̎̿̆̓̽̿̑̓́͛̀̐͆͑́͗͋̀͆͗͗͊̐̆̀͊͠͝ͅj̴̡̢̲͎̭̗͓̠͔̻͇̙̭͇̤̝̺̭̖̦̟̙̗̰̰̘̑̉͐̀̋̑͆͜͝ͅͅi̶̱͍̞̪͙͎̥͇̎̊́́͌̽̊̉̀̀͒̿̀̋̈́̂̽̎̎̒̏̒̿̑͗̌̃̃̍́̓̓̀̐̄̕̕̕͝͠͝ṣ̶̨̻̰̥̦̻̳̜̤̦͔͔̻̈́̇͛̂̔ͅẉ̸̨̨̥̭̪̹̫͍̱͈͓̙͛͋̎͒͒͐̅͋̓͛̇̔̒̍͌̌̀̇͒̀͗̒͒̔͊͛̓͛̇͊̚͝͝ͅͅŭ̶͔̱̟̩̼͖̯͔̹͚͙͚̟͕̳̣̫͔͗͗̀̈̈́̌͘h̴̡̧̨͙̜̯̗͍̆̈́͛̈́̕͜w̵̡̨̨̳̹̜̩̤̜͍̱̼̤̣̝̲͎͍̥̜̮̗͖̯͖̦̣̗̺̙̼̺̮̘̣̟̯̰̃͐̊̉́̀̽̒͊̃͌͊̔̾̋̋͛͐̈̀̾̿͋͊͒͋̉́͌͂̈́͋̈͘̕͘̚͘͜͜͝͠ͅù̴̡̨̨̨̨͉̻̙̠̜̪͚̳̱̬̠͈̠͉͍̱͇̱̩̟̳͙͉͎̆́͒̽̀̄̈́̑͐̐̉̂̄̉̈́̈́̔̉̒͒̔̉̈̈̐̎̇̃̕̚͘͜͝͝͝ͅs̸̡̡̧̢̻̠̫̖͈̼̘͍̮̫̯͔̣̰̜͔̝̜̲̯͉̟̫̙̭̫͓͕̺̙̣͆̓͑͂͜ͅͅw̵̛̛͓̗̰͎̽͊̂̋̌̈́̅̃̏̎̽́͌̋̍̃͛͛̀̔̐̽̽͛̈́̉̿̕͝u̸̧̨̡̟̣̺̖̯̫͈̯̬̭̣̫̙̠̮̻̗͚̠͌̌͋̈́̎̃̓͐̌̀̆̏̿̒̇̐̋͑͆̿̒̐̍̽̀̅́̀͒̓͌̊̂̕͝͠͠h̷̢͙̼̬͔̙̝͍̱̲͓̻͙̬̲̠̖͚̮̤̪̑͗̊̃͛̃̾̄̎̈͐̊̈͗̊̃̆̈́̚͘̕͜͠͝ͅw̷̨̰͍̘̰͇̣̹̞͔̟̭̙͓̫͔̦͎͎̲͕͇̔̎͌̿͛́͌͊̊͊ȗ̶̧̮͍̘̩̜̠̹̺͕̩̤͎͎̟̻͕̠̳̟̣͕͔͑̾̐̏͂́̔̔̌͛̃͊̆̋̈́̉̄̈̃̋͜͝ͅḥ̴̨̛̗̦͌̐͒̓̂̓͋͒̎̈́͋̽̒͐̓̅̔̎̿̂̃̈́̎̑̓̂͒͒̚͠ͅş̶̡̧̡̛̙͖͈̹̥̠̳͚̹͍͎̪͈̞̬͚̮̹̺̱͙̘͛̓̄͗̿̆̓̿̽͋̄̇̋̇̀̀͐̈̂͒̔͑̍̐̆̌̑͊̈͑̎̆̕͘͘̚͠͝͠͝",
	pointsName: "s̸̻͉͍̥̯͖̼̹͖͚̹̼͕̹̼͇̞̹͖͔͎͕͍̃̓̈͗͒̒̆̎́̎̊́̌͑͛̏̇̇̎̉̅̆̓̕͜͜͝j̷̢͍̺͔̹̻͕̔͗͌̄̈́̂͛̽̄͊̽͌̊͊̔͛̿̉̄̎̓̒̊̄̌͋̒̀̈́͌̈́̚͜͝͝n̸̨̲̘̭̜̭̖̭̉͋͊͛́͆̽́̿̆̔͛͑́͛͆̂̓͑̂̉́͘̚͠͝͝͠͝x̷̢̡͙̦͎͍̹͍̳̪̯͖̗̫͇͖͕̮͔͉͉̩͈̮͎̭̙̘̦̮̜̬̐̓̓̓̿͐̊͌͑̾̎̀͒̑̽͘͠j̷̨̧̧̛͇̼̯̬̰̟̦̗͈̬̱͎̈́̄͋̽̎̏̋̓̆̈́́̊̎̅̑̾̓̾̈͐̋̏̈̌͐̈́̚̕͠ͅn̴̛̛̫̘̫͓̱̺̖̟̯͋̏̂̽̈́͛̾́͛͂̓̿̄́̅̏̉̌͋̃̋̊̒̂̅̿̽̓̉͘̕͘͝͠͝s̵̢̨̢̱̟̥͚̫̤̙̣̥̭̣̹̮͎̪̯̹̺̟̟͎͓͇͗̄̓͛̔̊͗̇̔̏̒̆̏̑̊̅̾͐̑̎̒̌̌͐͑͒̎̚͜͝x̶̧̨̨̡̛̛̛̼̲̗̰͚̰̫̟̳͇̯̖̗̠͔̟̘͔̞̳̞͔̪̟̥͙̰̮̦͌͛́̓̏͒̈́͐͋̅̄̈́͑́̈̃̆̈́̄̽́̾̋̿͊̈́͋̆̆͐͂̆̂̚̚͝͝͠ͅj̵̨̡̯̣̣̯̞̥̤̰̹̲̻̠̰͔̙͇̭̰͕̬͔͉̤̭̠̥͇͈͌n̸͚̘͔̪͙̦̗͉̰͉̜͙͉̯͌̏ͅs̶̡̢̨̡͚͇̭̯̞͓̫̥̜̻͙͈̺̹̀̓̋̊̊͑̚͝͝ͅj̸̛̦̳̲͂͐̇̊̊̒̄͒͆̈́̈́̎̓̈́̅̓́̉͋̍͌̃̈́͑̈́̀̓͂̌̉͋͌̌̋̊̉͛̕͠͝",
	modFiles: ["layers.js", "tree.js"],

	discordName: "x_x",
	discordLink: "https://phurcase-japan78.blogspot.com",
	initialStartPoints: new Decimal (10), // Used for hard resets and new players
	offlineLimit: 1,  // In hours
}

// Set your version in num and name
let VERSION = {
	num: "ỉ̷̛̗̲̇͌̎͒̍͒̀̏͂̓̾̋̿͌̒͛͗͗j̶̱̀̏̒͗̔̄͋̚͠s̵̢͕̞̘̤̩̜̻̝̻̜̲͚̪̫͈͔̠̟͇̪̄̈͋̍̕͜͜͠w̶̢̧͖͇̫͇̼̫̝͎͉̮̘͚͙̏̄̑i̴̭͎̦̜̤̲̘̹̠̲̞̠̻̓̔̽̀͛͜s̷̡̨̢̩͓̝̻̮̞̭̩̭̹̩̘̱͙̞̬̖̰̻͈̜̖͚͕̤̋̾̈́͆̑̑͑̄̾̽̓̆̂̕͜͠h̶̡̧̦̞̟͇̺̥͎͎̲̳̳̭̲͕͉̪̼̳͗̍̆͛͛̾̆̈́̾̓͆̎̈́̑̈́̀̿͌͒́̎̐̅̅́̀́͐̄̔́̋͗̕͘͜͜͝͝͠ͅư̸̧̢̥͍͎͖̭̘͙̠̗͇̟͖̫̠̳̱̪̈̈́̒̀͗͗̎͗͋̽̃͗͛͆́̃́̆͛̊̋͋͒̈́̈́̽̀̉̑͂͋͂̈́̚̕͘͘͝͝͝ͅẇ̴̡̛̛̩̠̦̟͓̱̞̝̜̻̟̟͖̗̖̼̪̹̟̜͙͔̹̙͚̮̦̲̙̹̲̰̖̉̃̇̀̀̋͐́̒̍̐̔͂̃̆̀̑̒̍͗̒̋̊͌͘͘͘̚͝͝͠͝͠ͅͅș̷̡̨̛̲͚͕͉̲̖̥̙̠̮̦̩̖̪̭̤͕̤̟̖̫̌̽̃̎̚͜ͅų̷̢̛̟͇̖̲̯͉͖̩͇͔̱̗̩̻͇̓̈̌́̌̆̓̀͑͗͗̋̓͊̚h̷̲̹̟̱̱͖͍̲̥̘͔͇̮̥̻̬̉͌̈́̍̀̾ͅḩ̵͖̼̣̮̲̯̗͓̖̪̻͍͍̺̲͙͙̱̘͔̂̂́͐̏̍̋̐͊̿̅̉̽̋̂̅̀̈́̊͋̉̅̌̄̈̃̎̒͊̔̓̑͘͠͠͝ͅư̸̢͇̬͔͉̞̭͉̱̫͍̮͎͇̹͓͓̱̩̼̱͈̜͊̆̎̓̄̊̀̂̇́̓̀̈̇̾̅̃̏̅̀̚w̴̧̢̨͍̩͖̜͔̹͍̻͔̻̹̙̖̥̬͓̻̫̫͖͓͈͕̯͈͖͍̳̖̼͕̖̥̬̪͒̓̓͂̏s̸̡̛̲̮̦͓̗͙͔̦͍̬͉̟̙̦̞̞͚͆̓̒̂̿̈́̋͋͗͌͂͐̆̉͋̆͌̍̈̑͊̊̎̋̈̅̈́̎͛̚͜͠͠͠͝ͅh̸̡͓̩͍͖̙̗̙̹̺͎̦̅͗̈́̈̒̆͠ư̴̢̨̨̨̡̢̧̪̲͚̳͔̼̲͓̝̰̫̰̝͙̱͈͚̼͉̥̪̣̠̏͑̂̍̆͘͜͜ͅ",
	name: "s̸̡̡̨̠̪̥̳̺̪̭̦̖̪̙̲̮̺̩͖͚͖̜͓̹͉̻̭̱̥̽̏̔̊̒̾͑̅̕͘͜͝ņ̶̨̢̛͉̟̹͇̙͓̘̥̻̰͉̳̬͉̜̪͓͕̭̭̯̤͇̯̾́̑̓̅̂̄͆̓̑̐̆̽̑̅͊̃͑̋̑̈̊͑̓͆̊̈́̾̈́͌͑́̾̀̔̈́͘̚͠͠ͅj̸̧̛̙̱̟͓͎͖̦̗͔̃̊̈́̔̆̍̑̂͆̈́́͐̾̽̃͑̓͝͝ͅj̴̧̡͓͔͍̟̝̞̫̠͖͔̰̮͍̜̗̠̻͖͗͂̒̽̈́̎ş̸̨͇̭͔͈͍̞̯̗͈̙͋͋̐͆̈͑̓̉̌͆͋̓̏̎̓̀̿̋̽̈͘̚͜͝͝͠͠͝j̵̡̛̝̺̦̦̗̙͇͈͎͖͔̫͕͔͎̠̱̟̰̘͙̪͚͉̩͋̽̌̐̏̍͊̀͐̀͊̂̈́̉̈́̐͒̔̅̅͊̔͒̃́̏̅̚̚̕͜͝͝͠ͅͅŝ̷̢̨̢̻͚̹̙̟̟̞̞͓̟̯̥̻̻̲̣̫̯̬͖̤̝̘̹͎̙̲̣͔̥͓̰̺͌̋̿͋̋̔̑͒̌̋̅̒͛͗͐͐̅́̓͘͜͝͝͝ͅͅͅj̶̡̨̨͈̭̦̮̟̟̭̩̲̗̩͉̼͙̜͕́͛̉̏̉̾̊̂̾̊́̒̈́͋̅̈̓́́̎̉̏̋͑̑͐̚̕̕̚̕̚͠͝͝x̵̧̹͎̙͙̝͉͉̓͂͊̒̈́̿̓̇̄̌͝͝͝h̵̨̡̛̫̺̳̱̰̖͎̲̫̦̝̬̬̻̺̹͈͙̱̭̞̝̪̮̙̫́̓̌́̿͆̑̀͑͂͒̔͆̓͋̔͑͑̑͗̒̐̉̄̿͘͜͜͝͠͝ͅḧ̸͇͕̘̻͕̪͓̖̹̰̖̗̳̟̥̘̎̇͆͒͐̓́͋́͌̀̓̊̔͋̀͊͆̀̓̔͊̌̆͂̇̍͗̀̽̕̕͘͝͠ͅx̷̛̙͔͙͖̻̬̝̦̩̠̦̩̮̪̰̪̰̬̲͉̟̦̭̗͇̦͇͉̱̩͕̝̮̬̘̹͊́̓̎̇̊̌͐͊̆̒̃̈́͑̓̏̎̂͌͗͗͊̈̌́͐͂̿̍̃̀̿͝͝͠͝ͅḧ̶̛̰̭͙̩̩̬̩̲̖͔̽̀̓̔̆́̈́͐̈̉̅̋̒͛̑̆́͋͐͌̅̔̅̇͂́̓̀̚̕̕x̸̡̛̤͖̰͚̝̜̤͙̗̭͉̰̥̖̖̫͉͚͕̗͓̲̤͔̝̲͇̗̠͉̟̍͛͑̌̔̀̆̈̊̃̈̂̆͛́͛̇̈̒̚͜͝͠s̴̢͖̬̺͕̲̍̂̂̍̒̏͊̋̍̓́̀̏͛̂̆͛̑̈́̋͊̿̐̍͗͊̑͘̚̚͝s̸̡̡̡̛͚͕̟͕̦̤̟̪̖̩̪͎̭̝̭̦͎͉̰̘̲͉̰̮̲͒̋́͛̈͊͒̌̇̒͌͑̄̎̈́̆̄͆̌̌͋̍́͑̋̏̀͌̏̕͜͜͝͝j̷̨̢̰̜̹̤͉̥̩͓̪̰̙̦̭̩̺̣̠̯̱̞̬̺͈̹̙̰̯̘̗̝̘̿͒̅͌̋̇̌̉͊̈́͊́͋̅͘̕͘͝i̵̧̡̨̟͉̮̫̗͇̞͎̖̣͕̮͚͙̟̘̤͑̀̊͌́̈́̈̿̑̇̊̐͆̈́̑̈̎̌̾̽̀̚͘͝͝͝x̵̨̨̢̨̱̭̣̼͇̻̟̼͖̗̤͉̙͙̭͓͎̰̺̙̰͉̱̦͖̦͉̹̏͛͆͗̀̒̾̀͌͆̎͂̃͌̈̉̓̽̿͂̀̌̕͘̕͜͝͝͠j̴̨̰̗̣͚̲̗̰͉̟̺͎͈̟̰̘͔̼̩̻̗̖̽̈̄̅̅͊̔͌͂̇̆͆̓̓̈́̌͆̕͘̚̕͜͜͠͝͝s̵̨̛̮̪̪͈̥̰͖͌̾̈́̒̉̇̑̈̔̾͘͠",
}

let changelog = `j̴̢̢̨̧̞̤̖̠͍̼̟̫̥͔̘̮̬̮̖̙̖̦̰͕̝̰̻̞̭̗̰̥̑̑͋͐͛̈́̎́̏̎̊̀ͅͅz̸̡̡̨̩̜̻͙̰̱̻͎̣̦̠̩̫̘͈̮̱̗͈̭̠͓̮̝̺̲̫̙͙̣͖̯̘͉͇̑̾̒̅̀̍̑̑̓̏̉̽ͅj̷̱͎̙͖̯͈̲̝̪̺̜̪̦̲͙̤̥̅̾͛́̔́͑̆̋̉͛̋͋̓͛͐̀̐́̓̑̽͌̒̾̈́͂͌̊̀͘͘͘͜͝͠͠͝a̸̛̰͑̽͂̀́̚͠j̴̧̡̛͉̲̲̯͉̲̦̦̹͚̟̗̣̤̳̺͓̟̤̙͖̥̠͖̝͖͔̟͍̬̅̄̎͊̈̔͗͑̽͒̑́̃͋̊̔̆̓̉̆̂͑̎̈̑̆͐͗́̚͘͜͠j̴̟̠͙̱͙̯̟͓̹̥̞̗̹̩́̍͆̂̄͛͛͗͒̈́͊̽̀̀͊͊͒̂̉͂̕͝͝a̵̛͔̜̩̽̅̀̊̌̀͂̓̄̎̓̐́̽͛͆͆́̿͋͛̾̆͐͆͒͛̋̾͛̓̆̊̓͊̚u̴̢̧̹̣̼̝̺̥̼̫̱̲̺̲̺̺̫̯͈̯̻̣͛͘q̵̧̡̢̛̥̤̩͔̹̻̯̟̙̲̙̫̦̞̰̦̯̲̣͔͕̘͆͑̽̅͌͆̽̔̉̈́̃̂̀̊̋͜͠ṵ̸̺͗̒͌̿͂ͅà̶̧̧̨̧̡͔̣̬͍͖̻̹̺͔̪̘̗̩̠͔͉͕̩͙̝͔̬͉̜̯͕̪̩̦̣̮̤̹̃̉̐͛͘͜͜͠q̸̢̧̦̟̫̘͔̫͇̰̤̼̝̳͚̘͍̥̉̐͑͑͑̆̈́̋̈́́̌̈́̓̃̌̾̇̆̔͂́͑̔̂͒͋̓̊̅͘͜͠ą̸̛̛̻͎̬̯̙̳̳̙̞͔̗͓̫̦̱͓͉͕̞́͋̑̾͆͋̎̒̐̑̈̾̆̈́̾̌̿͊̅̒́̾͐͆̚͜͜͝͝j̷̧̡̨̧̳̩̱͙̹̙̗̰̬͚̥̳̖̳̼͇̹͕̭̳̪̯̣͚̹̈̎̆͐̎͗͆̿͑̒́͂̂͆͊̀́̋̿̑̽̋͋̏̈́̈͋̀̿͂̒̂̽̚̚͠͠͝͝͝ͅq̷̧̛̺̯̝͉͙̳̦̬̟̘̞͍̗̾̄̐͆̋͗͊̽̀̈́̃̓͛̆͛̓̅͆̓́̈́̈̈́̑̉̇̉̚̕͠͠͠i̸̡̠̺̭̦̥̺̗͚̹̺͓̤̬̝̪̜̹̦͇̙̙̥̰̩̭̤͓̪͒̉͝q̴̖̣̲͓̺͓̮͙͆̃͗̔͐̀̈̈̊̈́͋̐͊̄́̅̚̚͝͝͝͝͝ą̵̧͚͇̬͕̮͉͖͉͌͂̆̇͊͐̄͑̃̎̓̎̈́̒̒͌̋̕̕̕̚̕͘̕͜͝`

let winText = `Congratulations! You have reached the end and beaten this game, but for now...`

// If you add new functions anywhere inside of a layer, and those functions have an effect when called, add them here.
// (The ones here are examples, all official functions are already taken care of)
var doNotCallTheseFunctionsEveryTick = ["blowUpEverything"]

function getStartPoints(){
    return new Decimal(modInfo.initialStartPoints)
}

// Determines if it should show points/sec
function canGenPoints(){
	return true
}

// Calculate points/sec!
function getPointGen() {
	if(!canGenPoints())
		return new Decimal(0)

	let gain = new Decimal(0.5)
	return gain
}

// You can add non-layer related variables that should to into "player" and be saved here, along with default values
function addedPlayerData() { return {
}}

// Display extra things at the top of the page
var displayThings = [
]

// Determines when the game "ends"
function isEndgame() {
	return player.points.gte(new Decimal("e280000000"))
}



// Less important things beyond this point!

// Style for the background, can be a function
var backgroundStyle = {

}

// You can change this if you have things that can be messed up by long tick lengths
function maxTickLength() {
	return(3600) // Default is 1 hour which is just arbitrarily large
}

// Use this if you need to undo inflation from an older version. If the version is older than the version that fixed the issue,
// you can cap their current resources with this.
function fixOldSave(oldVersion){
}